load_test.yml
config:
  target: "http://127.0.0.1:3000"
  phases:
    - name: "Phase - 1"
      duration: 10
      arrivalRate: 1

    - name: "Phase -2 "
      duration: 60
      arrivalRate: 10
  payload:
    path: "users.csv"
    fields:
      - name
      - email
      - password
scenarios:
  - name: "User workflow"
    flow:
      - post:
          url: "/api/register"
          json:
            name: "{{ name }}"
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.tokens.token"
              as: "accessToken"
            - json: "$.data.tokens.refreshToken"
              as: "refreshToken"
      - post:
          url: "/api/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.token"
              as: "accessToken"
            - json: "$.data.refreshToken"
              as: "refreshToken"
      - post:
          url: "/api/todo"
          headers:
            authorization: "Bearer {{ accessToken }}"
          json:
            title: "Debug Todo"
            description: "Testing todo creation"
      - get:
          url: "/api/todo?page=1&limit=10"
          headers:
            authorization: "Bearer {{ accessToken }}"
          capture:
            - json: "$.data.total"
              as: "totalTodos"
            - json: "$.data.page"
              as: "currentPage"
      - delete:
          url: "/api/todo/{{ todoId }}"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - post:
          url: "/api/logout"
          json:
            token: "{{ refreshToken }}"